---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ElementChangedMoreThanAllowed
source: html/418975bc-9387-b74f-bf99-e565a62cd8df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ElementChangedMoreThanAllowed Property

The Grouped element has changed length enough to make it substantially different from other Group instances.
 To make this degree of change Edit Group and make the change again.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementChangedMoreThanAllowed { get; }
```